app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
  def index
    @items = Item.all

INSERT INTO `items` (`title`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `category_id`, `created_at`, `updated_at`) VALUES ('qq', 'download.jpg', 'image/jpeg', 7018, '2016-06-20 23:04:42.862562', 1, '2016-06-20 23:04:44.420822', '2016-06-20 23:04:44.420822')
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE `items` SET `category_id` = 3, `updated_at` = '2016-06-20 23:26:01.881825' WHERE `items`.`id` = 6
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 4
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 6 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])